	
{ "conv": [
"When does the Summer Semester begin at IBA and what is its duration?",

"The Summer Semester usually begins around the last week of May. The duration is usually six weeks, and ends around mid August. Classes of each course are held thrice a week on alternate days in the evenings.",


"How many courses are offered by IBA in the Summer Semester?",

"The number of courses offered by IBA in the summer semester varies from year to year.",

"How many courses can IBA students take in the summer semester?",

"An undergraduate student in general can take two courses in summer semester, whereas a MS student can take one course. However if the student is on internship then he is entitled to take one course only.",

"Which courses are offered in the Summer Semester?",

"The course offering is subject to the number of students who register in a particular course. Registration usually begins a few weeks before the start of the summer semester.",

"Who can take admission in the Summer Semester, and how does one apply?",

"Regular as well as visiting students can take admission. To apply students must come in person to the city campus, and visit the Evening Program Office between 3:00 to 7:00 pm. Details of the offerings are generally advertised in the Daily DAWN/JANG and IBA website, starting in April onwards. Students studying in foreign universities can also take courses in the Summer Semester to earn advance credits in their universities. Such students are required to provide a recommendation letter from their university.", 

"How can foreign students take admission in the Summer Semester?",

"It would be necessary for the students to bring a letter of recommendation from the University where they are studying indicating therein that they are willing to do summer course at IBA.",  

"Does the IBA offer undergraduate programs? If yes, what are they?",

"IBA offers the following undergraduate degree programs BBA BS(CS)BS (Accounting & Finance)BS (Social Sciences and Liberal Arts)BS (Economics)BS (Economics and Math's)",

"What is the duration of these Undergraduate Programs?",

"The duration of all Undergraduate Program is 4 years",

"What is the duration of the MBA Program?",

"There are two different durations for the MBA Programs 2 years for the Morning Programs 3.5 + years for the Evening Programs",
 
"Does the IBA offer any Executive Programs?",

"The IBA offers following program for executives and part time students - MBA Executive - MBA (Evening) - Certificate Courses - Summer Courses - Specialized courses conducted by the Center for Executive Education (CEE)"



]
}